{
  "personalInfo": {
    "name": "Alice Johnson",
    "title": "Senior Full Stack Developer",
    "email": "alice.johnson@example.com",
    "phone": "555-123-4567",
    "linkedin": "linkedin.com/in/alicejohnson",
    "github": "github.com/alicej"
  },
  "summary": "Highly experienced and results-driven Senior Full Stack Developer with 10+ years of expertise in designing, developing, and deploying scalable web applications. Proficient in modern JavaScript frameworks (React, Angular), backend technologies (Node.js, Python/Django), and cloud platforms (AWS, Azure). Strong advocate for clean code, test-driven development, and agile methodologies. Seeking to leverage advanced technical skills and leadership capabilities to deliver innovative solutions and drive team success.",
  "experience": [
    {
      "title": "Senior Software Engineer",
      "company": "Innovate Solutions Inc.",
      "years": "2021 - Present",
      "description": [
        "Led a team of 5 developers in the design and implementation of a new microservices architecture, improving system scalability by 40%.",
        "Developed critical features for a customer-facing portal using React, TypeScript, and GraphQL, resulting in a 25% increase in user engagement.",
        "Mentored junior and mid-level engineers, conducted regular code reviews, and fostered a culture of continuous improvement and knowledge sharing."
      ]
    },
    {
      "title": "Full Stack Developer",
      "company": "Global Tech Corp.",
      "years": "2017 - 2021",
      "description": [
        "Designed and developed RESTful APIs with Node.js and Express, supporting millions of daily transactions.",
        "Implemented responsive user interfaces using Angular and NgRx, integrating with various third-party services.",
        "Optimized database queries and application performance, reducing latency by 15% and improving user experience."
      ]
    },
    {
      "title": "Software Developer",
      "company": "Startup Innovations",
      "years": "2014 - 2017",
      "description": [
        "Built and maintained a CRM system using Python and Django, handling client data and interactions.",
        "Contributed to frontend development with jQuery and vanilla JavaScript, enhancing existing features and fixing bugs.",
        "Collaborated closely with product managers and designers to translate requirements into technical specifications and deliver features on time."
      ]
    }
  ],
  "education": [
    {
      "degree": "Master of Science in Computer Science",
      "university": "University of Technology",
      "years": "2014"
    },
    {
      "degree": "Bachelor of Science in Software Engineering",
      "university": "State Engineering College",
      "years": "2012"
    }
  ],
  "skills": {
    "programmingLanguages": ["JavaScript", "TypeScript", "Python", "Java", "Go"],
    "frontend": ["React", "Angular", "Vue.js", "HTML5", "CSS3", "Sass", "Webpack", "Vite", "Bootstrap", "Tailwind CSS"],
    "backend": ["Node.js", "Express.js", "Django", "Flask", "Spring Boot", "RESTful APIs", "GraphQL", "MongoDB", "PostgreSQL", "MySQL", "Redis"],
    "tools": ["Git", "Docker", "Kubernetes", "AWS", "Azure", "GCP", "Jira", "Jenkins", "CircleCI", "Jest", "Cypress", "Selenium"]
  },
  "projects": [
    {
      "name": "AI-Powered Recommendation Engine",
      "description": "Developed a real-time recommendation engine using machine learning algorithms, integrated into an e-commerce platform.",
      "technologies": ["Python", "TensorFlow", "Flask", "Kafka", "Redis"]
    },
    {
      "name": "Decentralized Chat Application",
      "description": "Created a secure, peer-to-peer chat application leveraging blockchain technology for data integrity and user authentication.",
      "technologies": ["Node.js", "WebSockets", "Ethereum", "Solidity"]
    },
    {
      "name": "Cloud Cost Optimization Dashboard",
      "description": "Built a dashboard to visualize and optimize cloud spending across multiple platforms, providing actionable insights to reduce infrastructure costs.",
      "technologies": ["React", "TypeScript", "AWS APIs", "Azure APIs", "GCP APIs", "D3.js"]
    }
  ]
}